witalis3/UA3REO-DDC-Transceiver/STM32/Src/front_unit.c
	{.port = 1, .channel = 4, .type = FUNIT_CTRL_BUTTON, .tres_min = 117, .tres_max = 250, .state = false, .prev_state = false, .work_in_menu = true, .parameter = 0, .clickHandler = FRONTPANEL_BUTTONHANDLER_MENU, .holdHandler = FRONTPANEL_BUTTONHANDLER_MENUHOLD}, //SB22 MENU
	{.port = 1, .channel = 4, .type = FUNIT_CTRL_BUTTON, .tres_min = 250, .tres_max = 354, .state = false, .prev_state = false, .work_in_menu = true, .parameter = 0, .clickHandler = FRONTPANEL_BUTTONHANDLER_TUNE, .holdHandler = FRONTPANEL_BUTTONHANDLER_TUNE}, //SB13 TUNE ATU
	{.port = 1, .channel = 4, .type = FUNIT_CTRL_BUTTON, .tres_min = 354, .tres_max = 492, .state = false, .prev_state = false, .work_in_menu = true, .parameter = 0, .clickHandler = FRONTPANEL_BUTTONHANDLER_MUTE, .holdHandler = FRONTPANEL_BUTTONHANDLER_MUTE_AFAMP}, //SB14 MUTE
	{.port = 1, .channel = 4, .type = FUNIT_CTRL_BUTTON, .tres_min = 492, .tres_max = 700, .state = false, .prev_state = false, .work_in_menu = true, .parameter = 0, .clickHandler = FRONTPANEL_BUTTONHANDLER_FUNC, .holdHandler = FRONTPANEL_BUTTONHANDLER_FUNCH}, //SB15 F1
	
	{.port = 1, .channel = 5, .type = FUNIT_CTRL_BUTTON, .tres_min = 117, .tres_max = 231, .state = false, .prev_state = false, .work_in_menu = true, .parameter = BANDID_10m, .clickHandler = FRONTPANEL_BUTTONHANDLER_SET_CUR_VFO_BAND, .holdHandler = FRONTPANEL_BUTTONHANDLER_SET_CUR_VFO_BAND}, //SB2 10M
	{.port = 1, .channel = 5, .type = FUNIT_CTRL_BUTTON, .tres_min = 231, .tres_max = 354, .state = false, .prev_state = false, .work_in_menu = true, .parameter = BANDID_CB, .clickHandler = FRONTPANEL_BUTTONHANDLER_SET_CUR_VFO_BAND, .holdHandler = FRONTPANEL_BUTTONHANDLER_SET_CUR_VFO_BAND}, //SB3 CB
	{.port = 1, .channel = 5, .type = FUNIT_CTRL_BUTTON, .tres_min = 354, .tres_max = 492, .state = false, .prev_state = false, .work_in_menu = true, .parameter = BANDID_2m, .clickHandler = FRONTPANEL_BUTTONHANDLER_SET_CUR_VFO_BAND, .holdHandler = FRONTPANEL_BUTTONHANDLER_SET_CUR_VFO_BAND}, //SB4 2M
	{.port = 1, .channel = 5, .type = FUNIT_CTRL_BUTTON, .tres_min = 492, .tres_max = 700, .state = false, .prev_state = false, .work_in_menu = true, .parameter = BANDID_FM, .clickHandler = FRONTPANEL_BUTTONHANDLER_SET_CUR_VFO_BAND, .holdHandler = FRONTPANEL_BUTTONHANDLER_SET_CUR_VFO_BAND}, //SB5 FM
		
	{.port = 1, .channel = 6, .type = FUNIT_CTRL_BUTTON, .tres_min = 117, .tres_max = 231, .state = false, .prev_state = false, .work_in_menu = true, .parameter = BANDID_20m, .clickHandler = FRONTPANEL_BUTTONHANDLER_SET_CUR_VFO_BAND, .holdHandler = FRONTPANEL_BUTTONHANDLER_SET_CUR_VFO_BAND}, //SB6 20M
	{.port = 1, .channel = 6, .type = FUNIT_CTRL_BUTTON, .tres_min = 231, .tres_max = 354, .state = false, .prev_state = false, .work_in_menu = true, .parameter = BANDID_17m, .clickHandler = FRONTPANEL_BUTTONHANDLER_SET_CUR_VFO_BAND, .holdHandler = FRONTPANEL_BUTTONHANDLER_SET_CUR_VFO_BAND}, //SB7 17M
	{.port = 1, .channel = 6, .type = FUNIT_CTRL_BUTTON, .tres_min = 354, .tres_max = 492, .state = false, .prev_state = false, .work_in_menu = true, .parameter = BANDID_15m, .clickHandler = FRONTPANEL_BUTTONHANDLER_SET_CUR_VFO_BAND, .holdHandler = FRONTPANEL_BUTTONHANDLER_SET_CUR_VFO_BAND}, //SB11 15M
	{.port = 1, .channel = 6, .type = FUNIT_CTRL_BUTTON, .tres_min = 492, .tres_max = 700, .state = false, .prev_state = false, .work_in_menu = true, .parameter = BANDID_12m, .clickHandler = FRONTPANEL_BUTTONHANDLER_SET_CUR_VFO_BAND, .holdHandler = FRONTPANEL_BUTTONHANDLER_SET_CUR_VFO_BAND}, //SB12 12M
		
	{.port = 1, .channel = 7, .type = FUNIT_CTRL_BUTTON, .tres_min = 117, .tres_max = 231, .state = false, .prev_state = false, .work_in_menu = true, .parameter = BANDID_160m, .clickHandler = FRONTPANEL_BUTTONHANDLER_SET_CUR_VFO_BAND, .holdHandler = FRONTPANEL_BUTTONHANDLER_SET_CUR_VFO_BAND}, //SB8 160M
	{.port = 1, .channel = 7, .type = FUNIT_CTRL_BUTTON, .tres_min = 231, .tres_max = 354, .state = false, .prev_state = false, .work_in_menu = true, .parameter = BANDID_80m, .clickHandler = FRONTPANEL_BUTTONHANDLER_SET_CUR_VFO_BAND, .holdHandler = FRONTPANEL_BUTTONHANDLER_SET_CUR_VFO_BAND}, //SB9 80M
	{.port = 1, .channel = 7, .type = FUNIT_CTRL_BUTTON, .tres_min = 354, .tres_max = 492, .state = false, .prev_state = false, .work_in_menu = true, .parameter = BANDID_40m, .clickHandler = FRONTPANEL_BUTTONHANDLER_SET_CUR_VFO_BAND, .holdHandler = FRONTPANEL_BUTTONHANDLER_SET_CUR_VFO_BAND}, //SB10 40M
	{.port = 1, .channel = 7, .type = FUNIT_CTRL_BUTTON, .tres_min = 492, .tres_max = 650, .state = false, .prev_state = false, .work_in_menu = true, .parameter = BANDID_30m, .clickHandler = FRONTPANEL_BUTTONHANDLER_SET_CUR_VFO_BAND, .holdHandler = FRONTPANEL_BUTTONHANDLER_SET_CUR_VFO_BAND}, //SB1 30M
	{.port = 1, .channel = 7, .type = FUNIT_CTRL_BUTTON, .tres_min = 650, .tres_max = 750, .state = false, .prev_state = false, .work_in_menu = true, .parameter = 0, .clickHandler = FRONTPANEL_ENC2SW_click_handler, .holdHandler = FRONTPANEL_ENC2SW_hold_handler}, //ENC2_SW
};

const PERIPH_FrontPanel_FuncButton PERIPH_FrontPanel_FuncButtonsList[FUNCBUTTONS_COUNT] = {
	{.name = "A / B", .work_in_menu = false, .clickHandler = FRONTPANEL_BUTTONHANDLER_AsB, .holdHandler = FRONTPANEL_BUTTONHANDLER_AsB},
	{.name = "B=A", .work_in_menu = false, .clickHandler = FRONTPANEL_BUTTONHANDLER_ArB, .holdHandler = FRONTPANEL_BUTTONHANDLER_ArB},
	{.name = "WPM", .work_in_menu = true, .clickHandler = FRONTPANEL_BUTTONHANDLER_WPM, .holdHandler = FRONTPANEL_BUTTONHANDLER_WPM},
	{.name = "POWER", .work_in_menu = true, .clickHandler = FRONTPANEL_BUTTONHANDLER_RF_POWER, .holdHandler = FRONTPANEL_BUTTONHANDLER_RF_POWER},
	{.name = "ANT", .work_in_menu = false, .clickHandler = FRONTPANEL_BUTTONHANDLER_ANT, .holdHandler = FRONTPANEL_BUTTONHANDLER_ANT},
	{.name = "SHIFT", .work_in_menu = false, .clickHandler = FRONTPANEL_BUTTONHANDLER_SHIFT, .holdHandler = FRONTPANEL_BUTTONHANDLER_SHIFT},
	{.name = "PLAY", .work_in_menu = false, .clickHandler = FRONTPANEL_BUTTONHANDLER_PLAY, .holdHandler = FRONTPANEL_BUTTONHANDLER_PLAY},
	{.name = "REC", .work_in_menu = false, .clickHandler = FRONTPANEL_BUTTONHANDLER_REC, .holdHandler = FRONTPANEL_BUTTONHANDLER_REC},
	{.name = "SERVICE", .work_in_menu = true, .clickHandler = FRONTPANEL_BUTTONHANDLER_SERVICES, .holdHandler = FRONTPANEL_BUTTONHANDLER_SERVICES},

