witalis3/UA3REO-DDC-Transceiver/STM32/Src/front_unit.c
	if (enc2_func_mode_idx == 1)
	{
		//ENC2 Func mode (WPM)
		TRX.CW_KEYER_WPM += direction;
		if (TRX.CW_KEYER_WPM < 1)
			TRX.CW_KEYER_WPM = 1;
		if (TRX.CW_KEYER_WPM > 200)
			TRX.CW_KEYER_WPM = 200;
		char sbuff[32] = {0};
		sprintf(sbuff, "WPM: %u", TRX.CW_KEYER_WPM);
		LCD_showTooltip(sbuff);
	}
	
	if (enc2_func_mode_idx == 2) //Fine SPLIT/SHIFT
	{
		if (TRX.ShiftEnabled && TRX.FineRITTune) {
			TRX_SHIFT += direction * 10;
			if(TRX_SHIFT > TRX.SHIFT_INTERVAL)
				TRX_SHIFT = TRX.SHIFT_INTERVAL;
			if(TRX_SHIFT < -TRX.SHIFT_INTERVAL)
				TRX_SHIFT = -TRX.SHIFT_INTERVAL;
		}
		
		if (TRX.SplitEnabled && TRX.FineRITTune) {
			TRX_SPLIT += direction * 10;
			if(TRX_SPLIT > TRX.SPLIT_INTERVAL)
				TRX_SPLIT = TRX.SPLIT_INTERVAL;
			if(TRX_SPLIT < -TRX.SPLIT_INTERVAL)
				TRX_SPLIT = -TRX.SPLIT_INTERVAL;
		}
	}
	
	if (enc2_func_mode_idx == 3) //Manual Notch
	{
		float64_t step = 50;
		if(CurrentVFO->Mode == TRX_MODE_CW)
			step = 10;
		if (CurrentVFO->ManualNotchFilter)
		{
			if (CurrentVFO->NotchFC > step && direction < 0)
				CurrentVFO->NotchFC -= step;
			else if (CurrentVFO->NotchFC < CurrentVFO->LPF_RX_Filter_Width && direction > 0)
				CurrentVFO->NotchFC += step;
			
			CurrentVFO->NotchFC = roundf((float64_t)CurrentVFO->NotchFC / step) * step;
			
			if(CurrentVFO->NotchFC < step)
				CurrentVFO->NotchFC = step;
			
			if(CurrentVFO->NotchFC > CurrentVFO->LPF_RX_Filter_Width)
				CurrentVFO->NotchFC = CurrentVFO->LPF_RX_Filter_Width;
			
			LCD_UpdateQuery.StatusInfoGUI = true;
			NeedReinitNotch = true;
			NeedWTFRedraw = true;
		}
	}	
}

void FRONTPANEL_check_ENC2SW(void)
{
// check touchpad events
#ifdef HAS_TOUCHPAD
	return;
#endif

	static uint32_t menu_enc2_click_starttime = 0;
	static bool ENC2SW_Last = true;
	static bool ENC2SW_clicked = false;
	static bool ENC2SW_hold_start = false;
	static bool ENC2SW_holded = false;
	ENC2SW_clicked = false;
	ENC2SW_holded = false;

	if (TRX.Locked)
		return;

	bool ENC2SW_AND_TOUCH_Now = HAL_GPIO_ReadPin(ENC2SW_AND_TOUCHPAD_GPIO_Port, ENC2SW_AND_TOUCHPAD_Pin);
	//check hold and click
	if (ENC2SW_Last != ENC2SW_AND_TOUCH_Now)
	{
		ENC2SW_Last = ENC2SW_AND_TOUCH_Now;
		if (!ENC2SW_AND_TOUCH_Now)
		{
			menu_enc2_click_starttime = HAL_GetTick();
			ENC2SW_hold_start = true;
		}
	}
	if (!ENC2SW_AND_TOUCH_Now && ENC2SW_hold_start)
	{
		if ((HAL_GetTick() - menu_enc2_click_starttime) > KEY_HOLD_TIME)
		{
			ENC2SW_holded = true;
			ENC2SW_hold_start = false;
		}
	}
	if (ENC2SW_AND_TOUCH_Now && ENC2SW_hold_start)
	{
		if ((HAL_GetTick() - menu_enc2_click_starttime) > 1)
		{
			ENC2SW_clicked = true;
			ENC2SW_hold_start = false;
		}
	}

	//ENC2 Button hold
	if (ENC2SW_holded)
	{
		FRONTPANEL_ENC2SW_hold_handler(0);
	}

	//ENC2 Button click
	if (ENC2SW_clicked)
	{
		menu_enc2_click_starttime = HAL_GetTick();
		FRONTPANEL_ENC2SW_click_handler(0);
	}
}

static void FRONTPANEL_ENC2SW_click_handler(uint32_t parameter)
{
	TRX_Inactive_Time = 0;
	//ENC2 CLICK
	if (!LCD_systemMenuOpened && !LCD_window.opened)
	{
		enc2_func_mode_idx++; //enc2 rotary mode
		
		if (enc2_func_mode_idx == 1 && CurrentVFO->Mode != TRX_MODE_CW) //no WPM if not CW
			enc2_func_mode_idx++;
		if (enc2_func_mode_idx == 2 && ((!TRX.ShiftEnabled && !TRX.SplitEnabled) || !TRX.FineRITTune)) //nothing to RIT tune
			enc2_func_mode_idx++;
		if (enc2_func_mode_idx == 3 && !CurrentVFO->ManualNotchFilter) //nothing to NOTCH tune
			enc2_func_mode_idx++;
		
		if(enc2_func_mode_idx > 3)
			enc2_func_mode_idx = 0;

		if (enc2_func_mode_idx == 0)
			LCD_showTooltip("FAST STEP");
		if (enc2_func_mode_idx == 1)
			LCD_showTooltip("SET WPM");
		if (enc2_func_mode_idx == 2)
			LCD_showTooltip("SET RIT");
		if (enc2_func_mode_idx == 3)
			LCD_showTooltip("SET NOTCH");
	}
	else
	{
		if (LCD_systemMenuOpened)
		{
			//navigate in menu
			SYSMENU_eventSecEncoderClickSystemMenu();
		}
	}
}

static void FRONTPANEL_ENC2SW_hold_handler(uint32_t parameter)
{
	TRX_Inactive_Time = 0;
	FRONTPANEL_BUTTONHANDLER_MENU(0);
}

void FRONTPANEL_Init(void)
{
	uint16_t test_value = 0;
#ifdef HRDW_MCP3008_1
	test_value = FRONTPANEL_ReadMCP3008_Value(0, AD1_CS_GPIO_Port, AD1_CS_Pin);
	if (test_value == 65535)
	{
		FRONTPanel_MCP3008_1_Enabled = false;
		println("[ERR] Frontpanel MCP3008 - 1 not found, disabling... (FPGA SPI/I2S CLOCK ERROR?)");
		LCD_showError("MCP3008 - 1 init error (FPGA I2S CLK?)", true);
	}
#endif
#ifdef HRDW_MCP3008_2
	test_value = FRONTPANEL_ReadMCP3008_Value(0, AD2_CS_GPIO_Port, AD2_CS_Pin);
	if (test_value == 65535)
	{
		FRONTPanel_MCP3008_2_Enabled = false;
		println("[ERR] Frontpanel MCP3008 - 2 not found, disabling... (FPGA SPI/I2S CLOCK ERROR?)");
		LCD_showError("MCP3008 - 2 init error", true);
	}
#endif
#ifdef HRDW_MCP3008_3
	test_value = FRONTPANEL_ReadMCP3008_Value(0, AD3_CS_GPIO_Port, AD3_CS_Pin);
	if (test_value == 65535)
	{
		FRONTPanel_MCP3008_3_Enabled = false;
		println("[ERR] Frontpanel MCP3008 - 3 not found, disabling... (FPGA SPI/I2S CLOCK ERROR?)");
		LCD_showError("MCP3008 - 3 init error", true);
	}
#endif
	FRONTPANEL_Process();
}

void FRONTPANEL_Process(void)
{
	if (LCD_systemMenuOpened && !LCD_busy && FRONTPANEL_ProcessEncoder1 != 0)
	{
		SYSMENU_eventRotateSystemMenu(FRONTPANEL_ProcessEncoder1);
		FRONTPANEL_ProcessEncoder1 = 0;
	}

	if (FRONTPANEL_ProcessEncoder2 != 0)
	{
		FRONTPANEL_ENCODER2_Rotated(FRONTPANEL_ProcessEncoder2);
		FRONTPANEL_ProcessEncoder2 = 0;
	}

#ifndef HAS_TOUCHPAD
	FRONTPANEL_check_ENC2SW();
#endif

	if(SD_USBCardReader)
		return;
	if (SPI_process)
		return;
	SPI_process = true;
	
	static uint32_t fu_debug_lasttime = 0;
	uint16_t buttons_count = sizeof(PERIPH_FrontPanel_Buttons) / sizeof(PERIPH_FrontPanel_Button);
	uint16_t mcp3008_value = 0;

	//process buttons
	for (uint16_t b = 0; b < buttons_count; b++)
	{
		PERIPH_FrontPanel_Button *button = &PERIPH_FrontPanel_Buttons[b];
//check disabled ports
#ifdef HRDW_MCP3008_1
		if (button->port == 1 && !FRONTPanel_MCP3008_1_Enabled)
			continue;
#endif
#ifdef HRDW_MCP3008_2
		if (button->port == 2 && !FRONTPanel_MCP3008_2_Enabled)
			continue;
#endif
#ifdef HRDW_MCP3008_3
		if (button->port == 3 && !FRONTPanel_MCP3008_3_Enabled)
			continue;
#endif
		
//get state from ADC MCP3008 (10bit - 1024values)
#ifdef HRDW_MCP3008_1
		if (button->port == 1)
			mcp3008_value = FRONTPANEL_ReadMCP3008_Value(button->channel, AD1_CS_GPIO_Port, AD1_CS_Pin);
		else
#endif
#ifdef HRDW_MCP3008_2
			if (button->port == 2)
			mcp3008_value = FRONTPANEL_ReadMCP3008_Value(button->channel, AD2_CS_GPIO_Port, AD2_CS_Pin);
		else
#endif
#ifdef HRDW_MCP3008_3
			if (button->port == 3)
			mcp3008_value = FRONTPANEL_ReadMCP3008_Value(button->channel, AD3_CS_GPIO_Port, AD3_CS_Pin);
		else
#endif
			continue;

		if (TRX.Debug_Type == TRX_DEBUG_BUTTONS)
		{
			static uint8_t fu_gebug_lastchannel = 255;
			if ((HAL_GetTick() - fu_debug_lasttime > 500 && fu_gebug_lastchannel != button->channel) || fu_debug_lasttime == 0)
			{
				println("F_UNIT: port ", button->port, " channel ", button->channel, " value ", mcp3008_value);
				fu_gebug_lastchannel = button->channel;
			}
		}

		//TANGENT
		if (button->type == FUNIT_CTRL_TANGENT)
		{
			//Yaesu MH-36
			if(CALIBRATE.TangentType == TANGENT_MH36)
				for (uint16_t tb = 0; tb < (sizeof(PERIPH_FrontPanel_TANGENT_MH36) / sizeof(PERIPH_FrontPanel_Button)); tb++)
					if(button->channel == PERIPH_FrontPanel_TANGENT_MH36[tb].channel)
						FRONTPANEL_CheckButton(&PERIPH_FrontPanel_TANGENT_MH36[tb], mcp3008_value);
			
			//Yaesu MH-48
			if(CALIBRATE.TangentType == TANGENT_MH48)
				for (uint16_t tb = 0; tb < (sizeof(PERIPH_FrontPanel_TANGENT_MH48) / sizeof(PERIPH_FrontPanel_Button)); tb++)
					if(button->channel == PERIPH_FrontPanel_TANGENT_MH48[tb].channel)
						FRONTPANEL_CheckButton(&PERIPH_FrontPanel_TANGENT_MH48[tb], mcp3008_value);
		}
		else
			FRONTPANEL_CheckButton(button, mcp3008_value); //other buttons / resistors
	}

	if (TRX.Debug_Type == TRX_DEBUG_BUTTONS)
	{
		if (HAL_GetTick() - fu_debug_lasttime > 500)
		{
			println("");
			fu_debug_lasttime = HAL_GetTick();
		}
	}

