witalis3/UA3REO-DDC-Transceiver/STM32/Src/front_unit.c
	LCD_closeWindow();
}

void FRONTPANEL_BUTTONHANDLER_SET_TX_BW(uint32_t parameter)
{
	if (CurrentVFO->Mode == TRX_MODE_CW)
		TRX.CW_LPF_Filter = parameter;
	if (CurrentVFO->Mode == TRX_MODE_LSB || CurrentVFO->Mode == TRX_MODE_USB)
		TRX.SSB_LPF_TX_Filter = parameter;
	if (CurrentVFO->Mode == TRX_MODE_DIGI_L || CurrentVFO->Mode == TRX_MODE_DIGI_U || CurrentVFO->Mode == TRX_MODE_RTTY)
		TRX.DIGI_LPF_Filter = parameter;
	if (CurrentVFO->Mode == TRX_MODE_AM || CurrentVFO->Mode == TRX_MODE_SAM)
		TRX.AM_LPF_TX_Filter = parameter;
	if (CurrentVFO->Mode == TRX_MODE_NFM)
		TRX.FM_LPF_TX_Filter = parameter;

	TRX_setMode(SecondaryVFO->Mode, SecondaryVFO);
	TRX_setMode(CurrentVFO->Mode, CurrentVFO);

	LCD_closeWindow();
}

void FRONTPANEL_BUTTONHANDLER_SETRF_POWER(uint32_t parameter)
{
	TRX.RF_Power = parameter;
	APROC_TX_clip_gain = 1.0f;
	APROC_TX_tune_power = 0.0f;
	ATU_TunePowerStabilized = false;
	LCD_closeWindow();
}

void FRONTPANEL_BUTTONHANDLER_SET_ATT_DB(uint32_t parameter)
{
	TRX.ATT_DB = parameter;
	
	int8_t band = getBandFromFreq(CurrentVFO->Freq, true);
	if (band >= 0)
	{
		TRX.BANDS_SAVED_SETTINGS[band].ATT = TRX.ATT;
		TRX.BANDS_SAVED_SETTINGS[band].ATT_DB = TRX.ATT_DB;
	}

	LCD_UpdateQuery.TopButtons = true;
	NeedSaveSettings = true;
	resetVAD();
	
	LCD_closeWindow();
}

void FRONTPANEL_BUTTONHANDLER_LEFT_ARR(uint32_t parameter)
{
	if (FRONTPANEL_funcbuttons_page == 0)
		FRONTPANEL_funcbuttons_page = (FUNCBUTTONS_PAGES - 1);
	else
		FRONTPANEL_funcbuttons_page--;

	LCD_UpdateQuery.BottomButtons = true;
	LCD_UpdateQuery.TopButtons = true;
}

void FRONTPANEL_BUTTONHANDLER_RIGHT_ARR(uint32_t parameter)
{
	if (FRONTPANEL_funcbuttons_page >= (FUNCBUTTONS_PAGES - 1))
		FRONTPANEL_funcbuttons_page = 0;
	else
		FRONTPANEL_funcbuttons_page++;

	LCD_UpdateQuery.BottomButtons = true;
	LCD_UpdateQuery.TopButtons = true;
}

static void FRONTPANEL_BUTTONHANDLER_SAMPLE_N(uint32_t parameter)
{
	if(CurrentVFO->Mode == TRX_MODE_WFM)
	{
		if (TRX.SAMPLERATE_FM > 0)
			TRX.SAMPLERATE_FM -= 1;
	}
	else
	{
		if (TRX.SAMPLERATE_MAIN > 0)
			TRX.SAMPLERATE_MAIN -= 1;
		int8_t band = getBandFromFreq(CurrentVFO->Freq, true);
		TRX.BANDS_SAVED_SETTINGS[band].SAMPLERATE = TRX.SAMPLERATE_MAIN;
	}
	
	FFT_Init();
	NeedReinitAudioFilters = true;
	LCD_UpdateQuery.StatusInfoBar = true;
}

static void FRONTPANEL_BUTTONHANDLER_SAMPLE_P(uint32_t parameter)
{
	if(CurrentVFO->Mode == TRX_MODE_WFM)
	{
		if (TRX.SAMPLERATE_FM < 3)
			TRX.SAMPLERATE_FM += 1;
	}
	else
	{
		if (TRX.SAMPLERATE_MAIN < 3)
			TRX.SAMPLERATE_MAIN += 1;
		int8_t band = getBandFromFreq(CurrentVFO->Freq, true);
		TRX.BANDS_SAVED_SETTINGS[band].SAMPLERATE = TRX.SAMPLERATE_MAIN;
	}
	
	FFT_Init();
	NeedReinitAudioFilters = true;
	LCD_UpdateQuery.StatusInfoBar = true;
}

void FRONTPANEL_BUTTONHANDLER_ZOOM_N(uint32_t parameter)
{
	if(CurrentVFO->Mode == TRX_MODE_CW)
	{
		if (TRX.FFT_ZoomCW == 2)
			TRX.FFT_ZoomCW = 1;
		else if (TRX.FFT_ZoomCW == 4)
			TRX.FFT_ZoomCW = 2;
		else if (TRX.FFT_ZoomCW == 8)
			TRX.FFT_ZoomCW = 4;
		else if (TRX.FFT_ZoomCW == 16)
			TRX.FFT_ZoomCW = 8;
	}
	else
	{
		if (TRX.FFT_Zoom == 2)
			TRX.FFT_Zoom = 1;
		else if (TRX.FFT_Zoom == 4)
			TRX.FFT_Zoom = 2;
		else if (TRX.FFT_Zoom == 8)
			TRX.FFT_Zoom = 4;
		else if (TRX.FFT_Zoom == 16)
			TRX.FFT_Zoom = 8;
	}
	
	FFT_Init();
	LCD_UpdateQuery.StatusInfoBar = true;
}

void FRONTPANEL_BUTTONHANDLER_ZOOM_P(uint32_t parameter)
{
	if(CurrentVFO->Mode == TRX_MODE_CW)
	{
		if (TRX.FFT_ZoomCW == 1)
			TRX.FFT_ZoomCW = 2;
		else if (TRX.FFT_ZoomCW == 2)
			TRX.FFT_ZoomCW = 4;
		else if (TRX.FFT_ZoomCW == 4)
			TRX.FFT_ZoomCW = 8;
		else if (TRX.FFT_ZoomCW == 8)
			TRX.FFT_ZoomCW = 16;
	}
	else
	{
		if (TRX.FFT_Zoom == 1)
			TRX.FFT_Zoom = 2;
		else if (TRX.FFT_Zoom == 2)
			TRX.FFT_Zoom = 4;
		else if (TRX.FFT_Zoom == 4)
			TRX.FFT_Zoom = 8;
		else if (TRX.FFT_Zoom == 8)
			TRX.FFT_Zoom = 16;
	}
	
	FFT_Init();
	LCD_UpdateQuery.StatusInfoBar = true;
}

void FRONTPANEL_SelectMemoryChannelsButtonHandler(uint32_t parameter)
{
	int8_t channel = parameter;
	if (channel >= MEMORY_CHANNELS_COUNT)
		channel = 0;
	
	TRX_setFrequency(CALIBRATE.MEMORY_CHANNELS[channel].Freq, CurrentVFO);
	TRX_setMode(CALIBRATE.MEMORY_CHANNELS[channel].Mode, CurrentVFO);
	if(TRX.SAMPLERATE_MAIN != CALIBRATE.MEMORY_CHANNELS[channel].SAMPLERATE)
	{
		TRX.SAMPLERATE_MAIN = CALIBRATE.MEMORY_CHANNELS[channel].SAMPLERATE;
		FFT_Init();
		NeedReinitAudioFilters = true;
	}
	TRX.LNA = CALIBRATE.MEMORY_CHANNELS[channel].LNA;
	TRX.ATT = CALIBRATE.MEMORY_CHANNELS[channel].ATT;
	TRX.ATT_DB = CALIBRATE.MEMORY_CHANNELS[channel].ATT_DB;
	TRX.ANT = CALIBRATE.MEMORY_CHANNELS[channel].ANT;
	TRX.ADC_Driver = CALIBRATE.MEMORY_CHANNELS[channel].ADC_Driver;
	CurrentVFO->SQL = CALIBRATE.MEMORY_CHANNELS[channel].SQL;
	CurrentVFO->FM_SQL_threshold_dbm = CALIBRATE.MEMORY_CHANNELS[channel].FM_SQL_threshold_dbm;
	TRX.SQL_shadow = CurrentVFO->SQL;
	TRX.FM_SQL_threshold_dbm_shadow = CurrentVFO->FM_SQL_threshold_dbm;
	TRX.ADC_PGA = CALIBRATE.MEMORY_CHANNELS[channel].ADC_PGA;
	CurrentVFO->DNR_Type = CALIBRATE.MEMORY_CHANNELS[channel].DNR_Type;
	CurrentVFO->AGC = CALIBRATE.MEMORY_CHANNELS[channel].AGC;
	TRX_Temporary_Stop_BandMap = false;

	LCD_UpdateQuery.TopButtons = true;
	LCD_UpdateQuery.FreqInfoRedraw = true;
	
	resetVAD();
	TRX_ScanMode = false;
	LCD_closeWindow();
	TRX_DXCluster_UpdateTime = 0;
}

void FRONTPANEL_SaveMemoryChannelsButtonHandler(uint32_t parameter)
{
	int8_t channel = parameter;
	if (channel >= MEMORY_CHANNELS_COUNT)
		channel = 0;
	
	CALIBRATE.MEMORY_CHANNELS[channel].Freq = CurrentVFO->Freq;
	CALIBRATE.MEMORY_CHANNELS[channel].Mode = CurrentVFO->Mode;
	CALIBRATE.MEMORY_CHANNELS[channel].SAMPLERATE = TRX.SAMPLERATE_MAIN;
	CALIBRATE.MEMORY_CHANNELS[channel].LNA = TRX.LNA;
	CALIBRATE.MEMORY_CHANNELS[channel].ATT = TRX.ATT;
	CALIBRATE.MEMORY_CHANNELS[channel].ATT_DB = TRX.ATT_DB;
	CALIBRATE.MEMORY_CHANNELS[channel].ANT = TRX.ANT;
	CALIBRATE.MEMORY_CHANNELS[channel].ADC_Driver = TRX.ADC_Driver;
	CALIBRATE.MEMORY_CHANNELS[channel].SQL = CurrentVFO->SQL;
	CALIBRATE.MEMORY_CHANNELS[channel].FM_SQL_threshold_dbm = CurrentVFO->FM_SQL_threshold_dbm;
	CALIBRATE.MEMORY_CHANNELS[channel].ADC_PGA = TRX.ADC_PGA;
	CALIBRATE.MEMORY_CHANNELS[channel].DNR_Type = CurrentVFO->DNR_Type;
	CALIBRATE.MEMORY_CHANNELS[channel].AGC = CurrentVFO->AGC;
	
	LCD_closeWindow();
	
	NeedSaveCalibration = true;
	LCD_showTooltip("Channel saved");
}
